<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.3" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="FusionInventory" namespace="FusionInventory" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
  </policyNamespaces>
  <resources minRequiredRevision="1.3" />
  <categories>
    <category name="FusionInventory_ROOT" displayName="$(string.FusionInventory_ROOT)">
      <parentCategory ref="windows:System" />
    </category>
  </categories>
  <policies>
    <policy name="FusionInventory_CONFIGURE" class="Machine" displayName="$(string.FusionInventory_CONFIGURE)" explainText="$(string.FusionInventory_CONFIGURE_EXPLAIN)" presentation="$(presentation.FusionInventory_CONFIGURE)" key="SOFTWARE\FusionInventory-Agent">
      <parentCategory ref="FusionInventory_ROOT" />
      <supportedOn ref="windows:SUPPORTED_WindowsXP" />
      <elements>
        <text id="FusionInventory_Server" key="SOFTWARE\FusionInventory-Agent" valueName="server" required="true" />
		<text id="FusionInventory_Proxy" key="SOFTWARE\FusionInventory-Agent" valueName="proxy" />
        <text id="FusionInventory_User" key="SOFTWARE\FusionInventory-Agent" valueName="user" />
        <text id="FusionInventory_Password" key="SOFTWARE\FusionInventory-Agent" valueName="password" />
        <text id="FusionInventory_Tag" key="SOFTWARE\FusionInventory-Agent" valueName="tag" />
        <text id="FusionInventory_ca-cert-dir" key="SOFTWARE\FusionInventory-Agent" valueName="ca-cert-dir" />
        <text id="FusionInventory_ca-cert-file" key="SOFTWARE\FusionInventory-Agent" valueName="ca-cert-file" />
        <text id="FusionInventory_httpd-ip" key="SOFTWARE\FusionInventory-Agent" valueName="httpd-ip" />
        <text id="FusionInventory_httpd-port" key="SOFTWARE\FusionInventory-Agent" valueName="httpd-port" required="true" />
        <text id="FusionInventory_httpd-trust" key="SOFTWARE\FusionInventory-Agent" valueName="httpd-trust" required="true" />
        <text id="FusionInventory_no-category" key="SOFTWARE\FusionInventory-Agent" valueName="no-category" />
		<text id="FusionInventory_no-task" key="SOFTWARE\FusionInventory-Agent" valueName="no-task" />
		<text id="FusionInventory_tasks" key="SOFTWARE\FusionInventory-Agent" valueName="tasks" />
        <decimal id="DXT_9F1637AA_9DC6_4642_B986_E17709212459" key="SOFTWARE\FusionInventory-Agent" valueName="delaytime" defaultValue="3600" required="true" />
        <decimal id="DXT_FCAD5C50_5A36_4390_9342_97F88FFC3D7E" key="SOFTWARE\FusionInventory-Agent" valueName="timeout" defaultValue="180" required="true" />
        <decimal id="DXT_75779EA7_02CB_4AA9_B112_4AE05C925472" key="SOFTWARE\FusionInventory-Agent" valueName="backend-collect-timeout" defaultValue="180"  required="true" />
        <enum id="DXT_9F1637AA_9DC6_4642_B986_E17774925725" valueName="debug" required="true">
          <item displayName="$(string.Off)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.Normal)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.Full)">
            <value>
              <decimal value="2" />
            </value>
          </item>
        </enum>
        <boolean id="FusionInventory_no-ssl-check" key="SOFTWARE\FusionInventory-Agent" valueName="no-ssl-check">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_no-p2p" key="SOFTWARE\FusionInventory-Agent" valueName="no-p2p">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_scan-homedirs" key="SOFTWARE\FusionInventory-Agent" valueName="scan-homedirs">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
		<boolean id="FusionInventory_scan-profiles" key="SOFTWARE\FusionInventory-Agent" valueName="scan-profiles">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_no-httpd" key="SOFTWARE\FusionInventory-Agent" valueName="no-httpd">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
    <policy name="FusionInventory_CONFIGURE32on64" class="Machine" displayName="$(string.FusionInventory_CONFIGURE32on64)" explainText="$(string.FusionInventory_CONFIGURE_EXPLAIN)" presentation="$(presentation.FusionInventory_CONFIGURE)" key="SOFTWARE\Wow6432Node\FusionInventory-Agent">
      <parentCategory ref="FusionInventory_ROOT" />
      <supportedOn ref="windows:SUPPORTED_WindowsXP" />
      <elements>
        <text id="FusionInventory_Server" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="server" required="true" />
		<text id="FusionInventory_Proxy" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="proxy" />
        <text id="FusionInventory_User" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="user" />
        <text id="FusionInventory_Password" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="password" />
        <text id="FusionInventory_Tag" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="tag" />
        <text id="FusionInventory_ca-cert-dir" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="ca-cert-dir" />
        <text id="FusionInventory_ca-cert-file" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="ca-cert-file" />
        <text id="FusionInventory_httpd-ip" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="httpd-ip" defaultValue="0.0.0.0" />
        <text id="FusionInventory_httpd-port" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="httpd-port" required="true" />
        <text id="FusionInventory_httpd-trust" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="httpd-trust" required="true" />
        <text id="FusionInventory_no-category" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="no-category" />
		<text id="FusionInventory_no-task" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="no-task" />
		<text id="FusionInventory_tasks" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="tasks" />
        <decimal id="DXT_9F1637AA_9DC6_4642_B986_E17709212459" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="delaytime" defaultValue="3600" required="true" />
        <decimal id="DXT_FCAD5C50_5A36_4390_9342_97F88FFC3D7E" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="timeout" defaultValue="180" required="true" />
        <decimal id="DXT_75779EA7_02CB_4AA9_B112_4AE05C925472" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="backend-collect-timeout" defaultValue="180" required="true" />
        <enum id="DXT_9F1637AA_9DC6_4642_B986_E17774925725" valueName="debug" required="true">
          <item displayName="$(string.Off)">
            <value>
              <decimal value="0" />
            </value>
          </item>
          <item displayName="$(string.Normal)">
            <value>
              <decimal value="1" />
            </value>
          </item>
          <item displayName="$(string.Full)">
            <value>
              <decimal value="2" />
            </value>
          </item>
        </enum>
        <boolean id="FusionInventory_no-ssl-check" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="no-ssl-check">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_no-p2p" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="no-p2p">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_scan-homedirs" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="scan-homedirs">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
		<boolean id="FusionInventory_scan-profiles" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="scan-profiles">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
        <boolean id="FusionInventory_no-httpd" key="SOFTWARE\Wow6432Node\FusionInventory-Agent" valueName="no-httpd">
          <trueValue>
            <decimal value="1" />
          </trueValue>
          <falseValue>
            <decimal value="0" />
          </falseValue>
        </boolean>
      </elements>
    </policy>
  </policies>
</policyDefinitions>
