<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter the full name here</displayName>
  <description>enter a description here</description>
  <resources>
    <stringTable>
      <string id="FusionInventory_ROOT">FusionInventory Agent</string>
      <string id="FusionInventory_CONFIGURE64">Configure Agent (64-bit)</string>
      <string id="FusionInventory_CONFIGURE32">Configure Agent (32-bit)</string>
      <string id="FusionInventory_CONFIGURE_EXPLAIN">Specifies a set of paremeters for FusionInventory agent.</string>
    </stringTable>
    <presentationTable>
      <presentation id="FusionInventory_CONFIGURE">
        <textBox refId="FusionInventory_Server">
          <label>Server</label>
        </textBox>
        <textBox refId="FusionInventory_User">
          <label>Name</label>
        </textBox>
        <textBox refId="FusionInventory_Password">
          <label>Password</label>
        </textBox>
        <textBox refId="FusionInventory_Realm">
          <label>Realm</label>
        </textBox>
        <textBox refId="FusionInventory_Tag">
          <label>Tag</label>
        </textBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
